In [2]:
import pandas as pd
import numpy as np
import os

In [3]:
csv_file = "Resources/purchase_data.csv"

In [4]:
purchase_data = pd.read_csv(csv_file)

In [5]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [6]:
Players = len(purchase_data["SN"].value_counts())

In [7]:
Total_Players=pd.DataFrame([Players], columns = ["Total Players"])

In [8]:
Total_Players

   Total Players
0            576

In [9]:
Unique_Items=len(purchase_data["Item ID"].unique())
Average_Price=purchase_data["Price"].mean()
Total_Purchases=purchase_data["Price"].count()
Total_Revenue=purchase_data["Price"].sum()

In [10]:
Unique_Items

179

In [11]:
Average_Price

3.050987179487176

In [12]:
Total_Purchases

780

In [13]:
Total_Revenue

2379.77

In [14]:
summary_df = pd.DataFrame(
    {"Unique Number of Items": [Unique_Items],
    "Average Price": [Average_Price],
    "Number of Purchases": [Total_Purchases],
    "Total Revenue": [Total_Revenue]})

summary_df

   Unique Number of Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [15]:
Gender_Counter = purchase_data["Gender"].value_counts()

In [16]:
Gender_Counter

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [17]:
Gender_Per = Gender_Counter/Total_Players

In [18]:
Gender_Per

   Female  Male  Other / Non-Disclosed  Total Players
0     NaN   NaN                    NaN            NaN

In [19]:
gender_df = pd.DataFrame({"Total Count": [Gender_Per],
    "Percentage of Players": [Gender_Counter]})

gender_df

,Total Count,Percentage of Players
0,Female Male Other / Non-Disclosed Total ...,Male 652 Female ...

In [20]:
Purchase_Counter = purchase_data.groupby(["Gender"]).count()["Price"]

In [21]:
Avg_Price = purchase_data.groupby(["Gender"]).mean()["Price"]

In [22]:
Total_Purchase_Value = purchase_data.groupby(["Gender"]).sum()["Price"]

In [28]:
analysis_df = pd.DataFrame(
    {"Purchase Price": [Purchase_Counter],
    "Average Purchase Price": [Avg_Price],
    "Total Purchase Value": [Total_Purchase_Value]})
analysis_df.head()

,Purchase Price,Average Purchase Price,Total Purchase Value
0,Gender Female 113 Male ...,Gender Female 3.203009 Male ...,Gender Female 361.94 Male ...

In [24]:
#I am unsure why my previous 2 examples are not breaking out. It looks like I am getting the correct numbers though.

In [25]:
bins = [0, 9.99, 14.99, 19.99, 24.99, 29.99, 34.99, 39.99, 999999]

In [26]:
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39","40+"]

In [27]:
df=purchase_data.loc[:,[ "SN" , "Age"]]
df["Age Range"] = pd.cut(df["Age"], bins, labels=group_names)
df.head()

              SN  Age Age Range
0        Lisim78   20     20-24
1    Lisovynya38   40       40+
2     Ithergue48   24     20-24
3  Chamassasya86   24     20-24
4      Iskosia90   23     20-24

In [76]:
df = df.groupby("Age Range")

In [77]:
Total_counter = df["Age"].count()

In [78]:
Total_counter

Age Range
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Age, dtype: int64

In [79]:
Percentage_Players = Total_counter / 576 * 100

In [80]:
Percentage_Players.round(2)

Age Range
<10       3.99
10-14     4.86
15-19    23.61
20-24    63.37
25-29    17.53
30-34    12.67
35-39     7.12
40+       2.26
Name: Age, dtype: float64

In [81]:
Age = pd.DataFrame({"Total Count": Total_counter , "Percentage of Players": Percentage_Players })

In [82]:
Age.round(2)

           Total Count  Percentage of Players
Age Range
<10                 23                   3.99
10-14               28                   4.86
15-19              136                  23.61
20-24              365                  63.37
25-29              101                  17.53
30-34               73                  12.67
35-39               41                   7.12
40+                 13                   2.26

In [83]:
Purchase_Count = purchase_data.groupby("SN")["Purchase ID"].count()

In [84]:
Purchase_Count

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Purchase ID, Length: 576, dtype: int64

In [85]:
Avg_Price = purchase_data.groupby("SN")["Purchase ID"].mean()

In [86]:
Avg_Price

SN
Adairialis76     467.000000
Adastirin33      142.000000
Aeda94           388.000000
Aela59            28.000000
Aelaria33        630.000000
                    ...
Yathecal82       466.666667
Yathedeu43       344.000000
Yoishirrala98    572.000000
Zhisrisu83        97.500000
Zontibe81        339.666667
Name: Purchase ID, Length: 576, dtype: float64

In [87]:
Total_Price = purchase_data.groupby("SN")["Purchase ID"].sum()

In [88]:
Total_Price

SN
Adairialis76      467
Adastirin33       142
Aeda94            388
Aela59             28
Aelaria33         630
                 ...
Yathecal82       1400
Yathedeu43        688
Yoishirrala98     572
Zhisrisu83        195
Zontibe81        1019
Name: Purchase ID, Length: 576, dtype: int64

In [89]:
Spenders = pd.DataFrame({"Purchase Count": Purchase_Count , "Average Purchase Price": Avg_Price , "Total Purchase Value": Total_Price})

In [90]:
Spenders.head()

              Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76               1                   467.0                   467
Adastirin33                1                   142.0                   142
Aeda94                     1                   388.0                   388
Aela59                     1                    28.0                    28
Aelaria33                  1                   630.0                   630

In [93]:
ID = purchase_data.groupby(purchase_data['Item ID'])

In [94]:
Most_Pop = ID['Item ID'].unique()

In [95]:
Most_Pop

Item ID
0        [0]
1        [1]
2        [2]
3        [3]
4        [4]
       ...
178    [178]
179    [179]
181    [181]
182    [182]
183    [183]
Name: Item ID, Length: 179, dtype: object

In [96]:
Name = ID["Item Name"].unique()

In [97]:
Name

Item ID
0                                          [Splinter]
1                                          [Crucifer]
2                                           [Verdict]
3                                      [Phantomlight]
4                                [Bloodlord's Fetish]
                            ...
178    [Oathbreaker, Last Hope of the Breaking Storm]
179                 [Wolf, Promise of the Moonwalker]
181                                   [Reaper's Toll]
182                                       [Toothpick]
183                             [Dragon's Greatsword]
Name: Item Name, Length: 179, dtype: object

In [98]:
Count = ID["Age"].count()

In [99]:
Count

Item ID
0       4
1       4
2       6
3       6
4       5
       ..
178    12
179     6
181     5
182     3
183     3
Name: Age, Length: 179, dtype: int64

In [100]:
Price = ID["Price"].mean()

In [101]:
Price

Item ID
0      1.2800
1      2.9425
2      2.4800
3      2.4900
4      1.7000
        ...
178    4.2300
179    4.4800
181    1.6600
182    4.0300
183    1.0900
Name: Price, Length: 179, dtype: float64

In [103]:
Value = ID["Price"].sum()

In [104]:
Value

Item ID
0       5.12
1      11.77
2      14.88
3      14.94
4       8.50
       ...
178    50.76
179    26.88
181     8.30
182    12.09
183     3.27
Name: Price, Length: 179, dtype: float64

In [105]:
Popular = pd.DataFrame({"Item Name": Name , "Purchase Count": Count , "Item Price": Price , "Total Purchase Value": Value})

In [107]:
Popular.head()

,Item Name,Purchase Count,Item Price,Total Purchase Value
Item ID,,,,
0,[Splinter],4,1.2800,5.12
1,[Crucifer],4,2.9425,11.77
2,[Verdict],6,2.4800,14.88
3,[Phantomlight],6,2.4900,14.94
4,[Bloodlord's Fetish],5,1.7000,8.50

In [110]:
Most_Popular = Popular.sort_values("Purchase Count", ascending=False)

In [111]:
Most_Popular.head()

,Item Name,Purchase Count,Item Price,Total Purchase Value
Item ID,,,,
92,[Final Critic],13,4.614615,59.99
178,"[Oathbreaker, Last Hope of the Breaking Storm]",12,4.230000,50.76
145,[Fiery Glass Crusader],9,4.580000,41.22
132,[Persuasion],9,3.221111,28.99
108,"[Extraction, Quickblade Of Trembling Hands]",9,3.530000,31.77

In [ ]:
#Most Profitable is the same table as most Popular

In [ ]:
#Trends
#1. Most popular items are relatively expensive 
#2. Large percentage of players are 24 and younger
#3. Large percentage of players are male